Read the following data set:
https://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data
Task:
1. Create an sqlalchemy engine using a sample from the data set
2. Write two basic update queries
3. Write two delete queries
4. Write two filter queries
5. Write two function queries

In [3]:
import random
import numpy as np
import pandas as pd
import sqlite3
from IPython.display import display
# Read the following data set:
# https://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data
adult_data_df = pd.read_csv('https://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data')
adult_data_df.columns =["age","workclass","fnlwgt","education","education_num","marital_status","occupation","relationship","race","sex","capital_gain","capital_loss","hours_per_week","native_country","income"]
adult_data_df.head()

,age,workclass,fnlwgt,education,education_num,marital_status,occupation,relationship,race,sex,capital_gain,capital_loss,hours_per_week,native_country,income
0,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
1,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
2,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
3,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K
4,37,Private,284582,Masters,14,Married-civ-spouse,Exec-managerial,Wife,White,Female,0,0,40,United-States,<=50K

In [51]:
#1. Create an sqlalchemy engine using a sample from the data set
import sqlalchemy
from sqlalchemy import create_engine
engine = create_engine('sqlite:///sqladb', echo=False)
adult_data_df.to_sql('sqladb', engine, if_exists='replace')

connection  = sqlite3.connect("sqladb")
cursor = connection.cursor()

In [52]:
# 2. Write two basic update queries
cursor.execute('UPDATE sqladb SET fnlwgt = "2847" WHERE fnlwgt = " 284582"')
print(pd.read_sql_query("SELECT * FROM sqladb", connection).head())

   index  age          workclass  fnlwgt   education  education_num  \
0      0   50   Self-emp-not-inc   83311   Bachelors             13
1      1   38            Private  215646     HS-grad              9
2      2   53            Private  234721        11th              7
3      3   28            Private  338409   Bachelors             13
4      4   37            Private    2847     Masters             14

        marital_status          occupation    relationship    race      sex  \
0   Married-civ-spouse     Exec-managerial         Husband   White     Male
1             Divorced   Handlers-cleaners   Not-in-family   White     Male
2   Married-civ-spouse   Handlers-cleaners         Husband   Black     Male
3   Married-civ-spouse      Prof-specialty            Wife   Black   Female
4   Married-civ-spouse     Exec-managerial            Wife   White   Female

   capital_gain  capital_loss  hours_per_week  native_country  income
0             0             0              13   United-States   <=50K
1             0             0              40   United-States   <=50K
2             0             0              40   United-States   <=50K
3             0             0              40            Cuba   <=50K
4             0             0              40   United-States   <=50K

In [53]:
# Second
cursor.execute('UPDATE sqladb SET workclass = "Private Sector" WHERE workclass = " Private"')
print(pd.read_sql_query("SELECT * FROM sqladb", connection).tail())

       index  age       workclass  fnlwgt    education  education_num  \
32555  32555   27  Private Sector  257302   Assoc-acdm             12
32556  32556   40  Private Sector  154374      HS-grad              9
32557  32557   58  Private Sector  151910      HS-grad              9
32558  32558   22  Private Sector  201490      HS-grad              9
32559  32559   52    Self-emp-inc  287927      HS-grad              9

            marital_status          occupation relationship    race      sex  \
32555   Married-civ-spouse        Tech-support         Wife   White   Female
32556   Married-civ-spouse   Machine-op-inspct      Husband   White     Male
32557              Widowed        Adm-clerical    Unmarried   White   Female
32558        Never-married        Adm-clerical    Own-child   White     Male
32559   Married-civ-spouse     Exec-managerial         Wife   White   Female

       capital_gain  capital_loss  hours_per_week  native_country  income
32555             0             0              38   United-States   <=50K
32556             0             0              40   United-States    >50K
32557             0             0              40   United-States   <=50K
32558             0             0              20   United-States   <=50K
32559         15024             0              40   United-States    >50K

In [54]:
# 3. Write two delete queries
# one
cursor.execute('DELETE FROM sqladb WHERE fnlwgt = " 201490"')
print(pd.read_sql_query("SELECT * FROM sqladb", connection).head())

   index  age          workclass  fnlwgt   education  education_num  \
0      0   50   Self-emp-not-inc   83311   Bachelors             13
1      1   38     Private Sector  215646     HS-grad              9
2      2   53     Private Sector  234721        11th              7
3      3   28     Private Sector  338409   Bachelors             13
4      4   37     Private Sector    2847     Masters             14

        marital_status          occupation    relationship    race      sex  \
0   Married-civ-spouse     Exec-managerial         Husband   White     Male
1             Divorced   Handlers-cleaners   Not-in-family   White     Male
2   Married-civ-spouse   Handlers-cleaners         Husband   Black     Male
3   Married-civ-spouse      Prof-specialty            Wife   Black   Female
4   Married-civ-spouse     Exec-managerial            Wife   White   Female

   capital_gain  capital_loss  hours_per_week  native_country  income
0             0             0              13   United-States   <=50K
1             0             0              40   United-States   <=50K
2             0             0              40   United-States   <=50K
3             0             0              40            Cuba   <=50K
4             0             0              40   United-States   <=50K

In [55]:
# Second
cursor.execute('DELETE FROM sqladb WHERE age = " 38" AND fnlwgt = " 215646"')
print(pd.read_sql_query("SELECT * FROM sqladb", connection).head(5))

   index  age          workclass  fnlwgt   education  education_num  \
0      0   50   Self-emp-not-inc   83311   Bachelors             13
1      2   53     Private Sector  234721        11th              7
2      3   28     Private Sector  338409   Bachelors             13
3      4   37     Private Sector    2847     Masters             14
4      5   49     Private Sector  160187         9th              5

           marital_status          occupation    relationship    race  \
0      Married-civ-spouse     Exec-managerial         Husband   White
1      Married-civ-spouse   Handlers-cleaners         Husband   Black
2      Married-civ-spouse      Prof-specialty            Wife   Black
3      Married-civ-spouse     Exec-managerial            Wife   White
4   Married-spouse-absent       Other-service   Not-in-family   Black

       sex  capital_gain  capital_loss  hours_per_week  native_country  income
0     Male             0             0              13   United-States   <=50K
1     Male             0             0              40   United-States   <=50K
2   Female             0             0              40            Cuba   <=50K
3   Female             0             0              40   United-States   <=50K
4   Female             0             0              16         Jamaica   <=50K

In [56]:
# 4. Write two filter queries
# One
cursor.execute('SELECT DISTINCT * FROM sqladb WHERE education = " Bachelors" AND age < 25 AND relationship = " Unmarried" AND sex = " Female" and native_country=" United-States"')
output = cursor.fetchall()
print(output)

[(12965, 23, 'Private Sector', 526164, ' Bachelors', 13, ' Never-married', ' Adm-clerical', ' Unmarried', ' Black', ' Female', 0, 0, 40, ' United-States', ' <=50K'), (16657, 22, 'Private Sector', 203182, ' Bachelors', 13, ' Never-married', ' Exec-managerial', ' Unmarried', ' White', ' Female', 0, 0, 30, ' United-States', ' <=50K'), (20335, 24, 'Private Sector', 187937, ' Bachelors', 13, ' Never-married', ' Prof-specialty', ' Unmarried', ' White', ' Female', 0, 0, 40, ' United-States', ' <=50K'), (31478, 24, 'Private Sector', 498349, ' Bachelors', 13, ' Never-married', ' Transport-moving', ' Unmarried', ' Black', ' Female', 0, 0, 40, ' United-States', ' <=50K')]

In [57]:
# Second
cursor.execute('SELECT DISTINCT * FROM sqladb WHERE education = " Bachelors" and age < 55 and income <= "50k" and native_country=" India"')
output = cursor.fetchall()
print(output)

[(10, 30, ' State-gov', 141297, ' Bachelors', 13, ' Married-civ-spouse', ' Prof-specialty', ' Husband', ' Asian-Pac-Islander', ' Male', 0, 0, 40, ' India', ' >50K'), (967, 48, 'Private Sector', 164966, ' Bachelors', 13, ' Married-civ-spouse', ' Exec-managerial', ' Husband', ' Asian-Pac-Islander', ' Male', 0, 0, 40, ' India', ' >50K'), (1094, 22, ' Self-emp-not-inc', 361280, ' Bachelors', 13, ' Never-married', ' Prof-specialty', ' Own-child', ' Asian-Pac-Islander', ' Male', 0, 0, 20, ' India', ' <=50K'), (4479, 30, 'Private Sector', 302149, ' Bachelors', 13, ' Married-civ-spouse', ' Sales', ' Husband', ' Asian-Pac-Islander', ' Male', 0, 0, 40, ' India', ' <=50K'), (4511, 29, 'Private Sector', 193260, ' Bachelors', 13, ' Married-civ-spouse', ' Craft-repair', ' Other-relative', ' Asian-Pac-Islander', ' Male', 0, 0, 30, ' India', ' <=50K'), (10106, 31, 'Private Sector', 341672, ' Bachelors', 13, ' Married-civ-spouse', ' Adm-clerical', ' Husband', ' Asian-Pac-Islander', ' Male', 0, 0, 60, ' India', ' <=50K'), (11834, 38, 'Private Sector', 167725, ' Bachelors', 13, ' Married-spouse-absent', ' Transport-moving', ' Not-in-family', ' Other', ' Male', 0, 0, 84, ' India', ' <=50K'), (13421, 53, 'Private Sector', 366957, ' Bachelors', 13, ' Married-civ-spouse', ' Exec-managerial', ' Husband', ' Asian-Pac-Islander', ' Male', 99999, 0, 50, ' India', ' >50K'), (13861, 45, 'Private Sector', 209912, ' Bachelors', 13, ' Married-civ-spouse', ' Exec-managerial', ' Husband', ' Asian-Pac-Islander', ' Male', 0, 0, 40, ' India', ' >50K'), (18555, 26, ' State-gov', 147719, ' Bachelors', 13, ' Never-married', ' Prof-specialty', ' Not-in-family', ' Asian-Pac-Islander', ' Male', 0, 0, 20, ' India', ' <=50K'), (21129, 49, 'Private Sector', 176341, ' Bachelors', 13, ' Never-married', ' Tech-support', ' Unmarried', ' Asian-Pac-Islander', ' Female', 0, 0, 40, ' India', ' <=50K'), (23021, 34, ' Self-emp-not-inc', 100079, ' Bachelors', 13, ' Married-civ-spouse', ' Sales', ' Husband', ' Asian-Pac-Islander', ' Male', 0, 0, 55, ' India', ' <=50K'), (24153, 46, 'Private Sector', 229737, ' Bachelors', 13, ' Married-civ-spouse', ' Sales', ' Husband', ' White', ' Male', 0, 0, 50, ' India', ' >50K'), (24980, 43, ' Self-emp-inc', 140988, ' Bachelors', 13, ' Married-civ-spouse', ' Sales', ' Other-relative', ' Asian-Pac-Islander', ' Male', 0, 0, 45, ' India', ' <=50K'), (26304, 27, 'Private Sector', 207352, ' Bachelors', 13, ' Married-civ-spouse', ' Tech-support', ' Husband', ' Asian-Pac-Islander', ' Male', 0, 0, 40, ' India', ' >50K'), (27973, 33, 'Private Sector', 173858, ' Bachelors', 13, ' Married-civ-spouse', ' Adm-clerical', ' Other-relative', ' Asian-Pac-Islander', ' Male', 0, 0, 40, ' India', ' <=50K'), (29206, 25, ' Local-gov', 124483, ' Bachelors', 13, ' Never-married', ' Adm-clerical', ' Not-in-family', ' Asian-Pac-Islander', ' Male', 0, 0, 20, ' India', ' <=50K'), (29727, 32, 'Private Sector', 79586, ' Bachelors', 13, ' Married-civ-spouse', ' Prof-specialty', ' Husband', ' Asian-Pac-Islander', ' Male', 0, 0, 40, ' India', ' <=50K'), (31326, 38, ' State-gov', 125499, ' Bachelors', 13, ' Married-civ-spouse', ' Prof-specialty', ' Husband', ' Asian-Pac-Islander', ' Male', 7688, 0, 60, ' India', ' >50K')]

In [58]:
# 5. Write two function queries

def new_entry(db_file, new_data):
    
    query = "INSERT INTO sqladb VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?);"

    cursor.execute(query, list(new_data))
    cursor.close()
    connection.close()

new_entry('sqladb',('32660', '30','Private', '7861369', 'Masters', '9', 'Married', 'Front_End', 'In_Family', 'Indian', 'Male', '0', '0', '40', 'United-States', '>=50K'))